# *******************************
# РАЗДЕЛ ИМПОРТА МОДУЛЕЙ
# *******************************

# *******************************
# РАЗДЕЛ СОЗДАННЫХ ФУНКЦИЙ
# *******************************
def genVis():
    HANGMAN_PICT = ['''
    +---+
        |
        |
        |
       ===''','''
    +---+
    O   |
        |
        |
       ===''',''' 
    +---+
    O   |
    |   |
        |
       ===''','''
    +---+
    O   |
    |   |
   ( )  |
       ===''','''
     +---+
     O   |
    /|\  |
    ( )  |
        ===''']

    return HANGMAN_PICT

def genSlov():
    words = ['аист,акула,баран,бубуин,барсук,бобр,верблюд,голубь,гусь.']
    return words
    
# *******************************
# ОСНОВНОЕ ТЕЛО ПРОГРАММЫ
# *******************************
vis = genVis()
for i in vis:
    print(i)
    print()